---
kind: method
id: M:Autodesk.Revit.DB.ParameterDownloadOptions.SetGroupTypeId(Autodesk.Revit.DB.ForgeTypeId)
source: html/26c452fd-9e26-f1c9-61c3-cd3e8c401bcf.htm
---
# Autodesk.Revit.DB.ParameterDownloadOptions.SetGroupTypeId Method

Set properties palette group identifier.

## Syntax (C#)
```csharp
public void SetGroupTypeId(
	ForgeTypeId groupTypeId
)
```

## Parameters
- **groupTypeId** (`Autodesk.Revit.DB.ForgeTypeId`)

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null